package dice

import "smallseal/dice/types"

var DefaultTextMap = types.TextTemplateWithWeightDict{
	"COC": {
		"设置房规_当前": {
			{`当前房规: {$t房规}\n{$t房规文本}`, 1},
		},
		"判定_大失败": {
			{"大失败！", 1},
		},
		"判定_失败": {
			{"失败！", 1},
		},
		"判定_成功_普通": {
			{"成功", 1},
		},
		"判定_成功_困难": {
			{"困难成功", 1},
		},
		"判定_成功_极难": {
			{"极难成功", 1},
		},
		"判定_大成功": {
			{"运气不错，大成功！", 1},
			{"大成功!", 1},
		},

		"判定_必须_困难_成功": {
			{"成功了！这要费点力气{$t附加判定结果}", 1},
		},
		"判定_必须_困难_失败": {
			{"失败！还是有点难吧？{$t附加判定结果}", 1},
		},
		"判定_必须_极难_成功": {
			{"居然成功了！运气不错啊！{$t附加判定结果}", 1},
		},
		"判定_必须_极难_失败": {
			{"失败了，不要太勉强自己{$t附加判定结果}", 1},
		},
		"判定_必须_大成功_成功": {
			{"大成功！越过无数失败的命运，你握住了唯一的胜机！", 1},
			{"大成功！这一定是命运石之门的选择！", 1},
		},
		"判定_必须_大成功_失败": {
			{"失败了，不出所料{$t附加判定结果}", 1},
		},

		"判定_简短_大失败": {
			{"大失败", 1},
		},
		"判定_简短_失败": {
			{"失败", 1},
		},
		"判定_简短_成功_普通": {
			{"成功", 1},
		},
		"判定_简短_成功_困难": {
			{"困难成功", 1},
		},
		"判定_简短_成功_极难": {
			{"极难成功", 1},
		},
		"判定_简短_大成功": {
			{"大成功", 1},
		},

		"检定_单项结果文本": {
			{`{$t检定表达式文本}={$t骰子出目}/{$t判定值}{$t检定计算过程} {$t判定结果}`, 1},
		},
		"检定": {
			{`{$t原因 ? '由于' + $t原因 + '，'}{$t玩家}的"{$t属性表达式文本}"检定结果为: {$t结果文本}`, 1},
		},
		"检定_多轮": {
			{`对{$t玩家}的"{$t属性表达式文本}"进行了{$t次数}次检定，结果为:\n{$t结果文本}`, 1},
		},
		"检定_轮数过多警告": {
			{`你真的需要这么多轮检定？{核心:骰子名字}将对你提高警惕！`, 1},
			{`不支持连续检定{$t次数}次，{核心:骰子名字}觉得这太多了。`, 1},
		},

		"检定_暗中_私聊_前缀": {
			{`来自群<{$t群名}>({$t群号})的暗中检定:\n`, 1},
		},
		"检定_暗中_群内": {
			{"{$t玩家}悄悄进行了一项{$t属性表达式文本}检定", 1},
		},
		"检定_格式错误": {
			{`检定命令格式错误`, 1},
		},

		// -------------------- sc --------------------------
		"提示_永久疯狂": {
			{`提示：理智归零，已永久疯狂(可用.ti或.li抽取症状)`, 1},
		},
		"提示_临时疯狂": {
			{`提示：单次损失理智超过5点，若智力检定(.ra 智力)通过，将进入临时性疯狂(可用.ti或.li抽取症状)`, 1},
		},

		"理智检定_单项结果文本": {
			{`{$t检定表达式文本}={$t骰子出目}/{$t判定值}{$t检定计算过程} {$t判定结果}`, 1},
		},
		"理智检定": {
			{"{$t玩家}的理智检定:\n{$t结果文本}\n理智变化: {$t旧值} ➯ {$t新值} (扣除{$t表达式文本}={$t表达式值}点){$t附加语}\n{$t提示_角色疯狂}", 1},
		},

		"理智检定_附加语_成功": {
			{"", 1},
		},
		"理智检定_附加语_失败": {
			{"", 1},
		},
		"理智检定_附加语_大成功": {
			{`\n不错的结果，可惜毫无意义`, 1},
		},
		"理智检定_附加语_大失败": {
			{`\n你很快就能洞悉一切`, 1},
			{`\n精彩的演出，希望主演不要太快谢幕`, 1},
		},
		"理智检定_格式错误": {
			{`理智检定命令格式错误`, 1},
		},
		// -------------------- sc end --------------------------

		// -------------------- st --------------------------
		"属性设置_删除": {
			{`{$t玩家}的如下属性被成功删除:{$t属性列表}，失败{$t失败数量}项`, 1},
		},
		"属性设置_清除": {
			{`{$t玩家}的属性数据已经清除，共计{$t数量}条`, 1},
		},
		"属性设置_增减_单项": {
			{"{$t属性}: {$t旧值} ➯ {$t新值} ({$t增加或扣除}{$t表达式文本}={$t变化量})", 1},
		},
		"属性设置_增减": {
			{"{$t玩家}的属性变化:\n{$t变更列表}\n{COC:属性设置_保存提醒}", 1},
		},
		"属性设置_增减_错误的值": {
			{`"{$t玩家}: 错误的增减值: {$t表达式文本}"`, 1},
		},
		"属性设置_列出": {
			{"{$t玩家}的个人属性为:\n{$t属性信息}", 1},
		},
		"属性设置_列出_未发现记录": {
			{`未发现属性记录`, 1},
		},
		"属性设置_列出_隐藏提示": {
			{`\n注：{$t数量}条属性因<{$t判定值}被隐藏`, 1},
		},
		"属性设置": {
			{`{$t玩家}的{$t规则模板}属性录入完成，本次录入了{$t有效数量}条数据`, 1},
		},
		"属性设置_保存提醒": {
			{`{ $t当前绑定角色 ? '[√] 已绑卡' : '' }`, 1},
		},
		// -------------------- st end --------------------------

		// -------------------- en --------------------------
		"技能成长_导入语": {
			{"{$t玩家}的“{$t技能}”成长检定：", 1},
		},
		"技能成长_错误的属性类型": {
			{"{COC:技能成长_导入语}\n{COC:技能成长_错误的属性类型_无前缀}", 1},
		},
		"技能成长_错误的属性类型_无前缀": {
			{"该属性不能成长", 1},
		},
		"技能成长_错误的失败成长值": {
			{"{COC:技能成长_导入语}\n{COC:技能成长_错误的失败成长值_无前缀}", 1},
		},
		"技能成长_错误的失败成长值_无前缀": {
			{"错误的失败成长值: {$t表达式文本}", 1},
		},
		"技能成长_错误的成功成长值": {
			{"{COC:技能成长_导入语}\n{COC:技能成长_错误的成功成长值_无前缀}", 1},
		},
		"技能成长_错误的成功成长值_无前缀": {
			{"错误的成功成长值: {$t表达式文本}", 1},
		},
		"技能成长_属性未录入": {
			{"{COC:技能成长_导入语}\n{COC:技能成长_属性未录入_无前缀}", 1},
		},
		"技能成长_属性未录入_无前缀": {
			{"你没有使用st录入这个属性，或在en指令中指定属性的值", 1},
		},
		"技能成长_结果_成功": {
			{"{COC:技能成长_结果_成功_无后缀}\n{COC:属性设置_保存提醒}", 1},
		},
		"技能成长_结果_成功_无后缀": {
			{"“{$t技能}”增加了{$t表达式文本}={$t增量}点，当前为{$t新值}点", 1},
		},
		"技能成长_结果_失败": {
			{"“{$t技能}”成长失败了！", 1},
		},
		"技能成长_结果_失败变更": {
			{"{COC:技能成长_结果_失败变更_无后缀}\n{COC:属性设置_保存提醒}", 1},
		},
		"技能成长_结果_失败变更_无后缀": {
			{"“{$t技能}”变化{$t表达式文本}={$t增量}点，当前为{$t新值}点", 1},
		},
		"技能成长": {
			{"{COC:技能成长_导入语}\nD100={$t骰子出目}/{$t判定值} {$t判定结果}\n{$t结果文本}", 1},
		},
		"技能成长_批量_分隔符": {
			{`\n\n`, 1},
		},
		"技能成长_批量_导入语": {
			{"{$t玩家}的{$t数量}项技能的批量成长检定：", 1},
		},
		"技能成长_批量_单条": {
			{"“{$t技能}”：D100={$t骰子出目}/{$t判定值} {$t判定结果}\n{$t结果文本}", 1},
		},
		"技能成长_批量_单条错误前缀": {
			{"“{$t技能}”：", 1},
		},
		"技能成长_批量": {
			{"{COC:技能成长_批量_导入语}\n{$t总结果文本}\n{COC:属性设置_保存提醒}", 1},
		},
		"技能成长_批量_技能过多警告": {
			{`试图成长{$t数量}项技能，但{核心:骰子名字}没有这么多骰子。`, 1},
		},
		// -------------------- en end --------------------------
		"制卡": {
			{"{$t玩家}的七版COC人物作成:\n{$t制卡结果文本}", 1},
		},
		"制卡_分隔符": {
			{"#{SPLIT}", 1},
		},
		"对抗检定": {
			{`对抗检定:
{$t玩家A} {$t玩家A判定式}-> 属性值:{$t玩家A属性} 判定值:{$t玩家A出目}{$t玩家A判定过程} {$t玩家A判定结果}
{$t玩家B} {$t玩家B判定式}-> 属性值:{$t玩家B属性} 判定值:{$t玩家B出目}{$t玩家B判定过程} {$t玩家B判定结果}
{% $tWinFlag == -1 ? $t玩家A + '胜出！',
   $tWinFlag == +1 ? $t玩家B + '胜出！',
   $tWinFlag == 0 ? '平手！(请自行根据场景，如属性比较、攻击对反击，攻击对闪避)做出判断'
%}`, 1},
		},
		// -------------------- ti li --------------------------
		"疯狂发作_即时症状": {
			{"{$t玩家}的疯狂发作-即时症状:\n{$t表达式文本}\n{$t疯狂描述}", 1},
		},
		"疯狂发作_总结症状": {
			{"{$t玩家}的疯狂发作-总结症状:\n{$t表达式文本}\n{$t疯狂描述}", 1},
		},
		// -------------------- ti li end --------------------------
	},

	"DND": {
		"属性设置_删除": {
			{`{$t玩家}的如下属性被成功删除:{$t属性列表}，失败{$t失败数量}项`, 1},
		},
		"属性设置_清除": {
			{`{$t玩家}的属性数据已经清除，共计{$t数量}条`, 1},
		},
		"属性设置_列出": {
			{`{$t玩家}的个人属性为:\n{$t属性信息}`, 1},
		},
		"属性设置_列出_未发现记录": {
			{`未发现属性记录`, 1},
		},
		"属性设置_列出_隐藏提示": {
			{`\n注：{$t数量}条属性因<{$t判定值}被隐藏`, 1},
		},
		"BUFF设置_删除": {
			{`{$t玩家}的如下BUFF被成功删除:{$t属性列表}，失败{$t失败数量}项`, 1},
		},
		"BUFF设置_清除": {
			{`{$t玩家}的BUFF数据已经清除，共计{$t数量}条`, 1},
		},
		"先攻_查看_前缀": {
			{`当前先攻列表为:\n`, 1},
		},
		"先攻_移除_前缀": {
			{`{$t玩家}将以下单位从先攻列表中移除:\n`, 1},
		},
		"先攻_清除列表": {
			{`先攻列表已清除`, 1},
		},
		"先攻_设置_指定单位": {
			{"{$t玩家}已设置 {$t目标} 的先攻点为{$t表达式}{% $t计算过程 ? `{$t计算过程} =` %} {$t点数}\\n", 1},
		},
		"先攻_设置_前缀": {
			{`{$t玩家}对先攻点数设置如下:\n`, 1},
		},
		"先攻_设置_格式错误": {
			{`{$t玩家}的ri格式不正确!`, 1},
		},
		"先攻_下一回合": {
			{"【{$t当前回合角色名}】戏份结束了。\n{$t新轮开始提示}下面该【{$t下一回合角色名}】{$t下一回合at}出场了！\n同时请【{$t下下一回合角色名}】{$t下下一回合at}做好准备", 1},
		},
		"先攻_新轮开始提示": {
			{"新的一轮开始了！\n", 1},
		},
		"死亡豁免_D20_附加语": {
			{`你觉得你还可以抢救一下！HP回复1点！`, 1},
		},
		"死亡豁免_D1_附加语": {
			{`伤势莫名加重了！死亡豁免失败+2！`, 1},
		},
		"死亡豁免_成功_附加语": {
			{`伤势暂时得到控制！死亡豁免成功+1`, 1},
		},
		"死亡豁免_失败_附加语": {
			{`有些不妙！死亡豁免失败+1`, 1},
		},
		"死亡豁免_结局_伤势稳定": {
			{`累计获得了3次死亡豁免检定成功，伤势稳定了！`, 1},
		},
		"死亡豁免_结局_角色死亡": {
			{`累计获得了3次死亡豁免检定失败，不幸去世了！`, 1},
		},
		"受到伤害_超过HP上限_附加语": {
			{`\n{$t玩家}遭受了{$t伤害点数}点过量伤害，超过了他的承受能力，一命呜呼了！`, 1},
		},
		"受到伤害_昏迷中_附加语": {
			{`\n{$t玩家}在昏迷状态下遭受了{$t伤害点数}点过量伤害，死亡豁免失败+1！`, 1},
		},
		"受到伤害_进入昏迷_附加语": {
			{`\n{$t玩家}遭受了{$t伤害点数}点过量伤害，生命值降至0，陷入了昏迷！`, 1},
		},
		"制卡_预设模式": {
			{"{$t玩家}使用预设模板的DND5E人物作成:\n{$t制卡结果文本}", 1},
		},
		"制卡_自由分配模式": {
			{"{$t玩家}使用自由分配的DND5E人物作成:\n{$t制卡结果文本}", 1},
		},
		"制卡_分隔符": {
			{`\n`, 1},
		},
		"检定_单项结果文本": {
			{`{$t检定过程文本} = {$t检定结果}`, 1},
		},
		"检定": {
			{`{$t玩家}的"{$t技能}"检定（DND5E）结果为: {$t检定过程文本} = {$t检定结果}`, 1},
		},
		"检定_多轮": {
			{`对{$t玩家}的"{$t技能}"进行了{$t次数}次检定（DND5E），结果为:\n{$t结果文本}`, 1},
		},
		"检定_轮数过多警告": {
			{`你真的需要这么多轮检定？{核心:骰子名字}将对你提高警惕！`, 1},
			{`不支持连续检定{$t次数}次，{核心:骰子名字}觉得这太多了。`, 1},
		},
	},
	"核心": {
		"骰子名字": {
			{"海豹核心", 1},
		},
		"骰子帮助文本_附加说明": {
			{"========\n.help 骰点/骰主/协议/娱乐/跑团/扩展/查询/其他\n========\n一只海豹罢了", 1},
		},
		"骰子帮助文本_骰主": {
			{"骰主很神秘，什么都没有说——", 1},
		},
		"骰子帮助文本_协议": {
			{"请在遵守以下规则前提下使用:\n1. 遵守国家法律法规\n2. 在跑团相关群进行使用\n3. 不要随意踢出、禁言、刷屏\n4. 务必信任骰主，有事留言\n如不同意使用.bot bye使其退群，谢谢。\n祝玩得愉快。", 1},
		},
		"骰子帮助文本_娱乐": {
			{"帮助:娱乐\n.gugu // 随机召唤一只鸽子\n.jrrp 今日人品", 1},
		},
		"骰子帮助文本_其他": {
			{"帮助:其他\n.find 克苏鲁星之眷族 //查找对应怪物资料\n.find 70尺 法术 // 查找关联资料（仅在全文搜索开启时可用）", 1},
		},
		"骰子执行异常": {
			{"指令执行异常，请联系开发者，群号524364253，非常感谢。", 1},
		},
		"骰子开启": {
			{"{常量:APPNAME} 已启用 {常量:VERSION}", 1},
		},
		"骰子关闭": {
			{"<{核心:骰子名字}> 停止服务", 1},
		},
		"骰子进群": {
			{`<{核心:骰子名字}> 已经就绪。可通过.help查看手册\n[图:data/images/sealdice.png]\nCOC/DND玩家可以使用.set coc/dnd在两种模式中切换\n已搭载自动重连，如遇风控不回可稍作等待`, 1},
		},
		"骰子成为好友": {
			{`<{核心:骰子名字}> 已经就绪。可通过.help查看手册，请拉群测试，私聊容易被企鹅吃掉。\n[图:data/images/sealdice.png]`, 1},
		},
		"骰子退群预告": {
			{"收到指令，5s后将退出当前群组", 1},
		},
		"骰子自动退群告别语": {
			{"由于长时间不使用，{核心:骰子名字}将退出本群，感谢您的使用。", 1},
		},
		"骰子保存设置": {
			{"数据已保存", 1},
		},
		"骰子状态附加文本": {
			{"供职于{$t供职群数}个群，其中{$t启用群数}个处于开启状态。{$t群内工作状态}", 1},
		},
		// -------------------- roll --------------------------
		"骰点_原因": {
			{"由于{$t原因}，", 1},
		},
		"骰点_单项结果文本": {
			{`{$t表达式文本}{$t计算过程}={$t计算结果}`, 1},
		},
		"骰点": {
			{"{$t原因句子}{$t玩家}掷出了 {$t结果文本}", 1},
		},
		"骰点_多轮": {
			{`{$t原因句子}{$t玩家}掷骰{$t次数}次:\n{$t结果文本}`, 1},
		},
		"骰点_轮数过多警告": {
			{`骰点的轮数多到异常，{核心:骰子名字}将对你提高警惕！`, 1},
			{`骰点{$t次数}轮？{核心:骰子名字}没有这么多骰子。`, 1},
		},
		// -------------------- roll end --------------------------
		"暗骰_群内": {
			{"黑暗的角落里，传来命运转动的声音", 1},
			{"诸行无常，命数无定，答案只有少数人知晓", 1},
			{"命运正在低语！", 1},
		},
		"暗骰_私聊_前缀": {
			{`来自群<{$t群名}>({$t群号})的暗骰:\n`, 1},
		},
		"昵称_当前": {
			{"玩家的当前昵称为: {$t玩家}", 1},
		},
		"昵称_重置": {
			{"{$t旧昵称}({$t帐号ID})的昵称已重置为{$t玩家}", 1},
		},
		"昵称_改名": {
			{"{$t旧昵称}({$t帐号ID})的昵称被设定为{$t玩家}", 1},
		},
		"设定默认骰子面数": {
			{"设定个人默认骰子面数为 {$t个人骰子面数}", 1},
		},
		"设定默认群组骰子面数": {
			{"设定群组默认骰子面数为 {$t群组骰子面数}", 1},
		},
		"设定默认骰子面数_错误": {
			{"设定默认骰子面数: 格式错误", 1},
		},
		"设定默认骰子面数_重置": {
			{"重设默认骰子面数为默认值", 1},
		},
		// -------------------- ch --------------------------
		"角色管理_新建": {
			{"新建角色且自动绑定: {$t角色名}", 1},
		},
		"角色管理_新建_已存在": {
			{"已存在同名角色", 1},
		},
		"角色管理_绑定_成功": {
			{"切换角色\"{$t角色名}\"，绑定成功", 1},
		},
		"角色管理_绑定_失败": {
			{"角色\"{$t角色名}\"绑定失败，角色不存在", 1},
		},
		"角色管理_绑定_解除": {
			{"角色\"{$t角色名}\"绑定已解除，切换至群内角色卡", 1},
		},
		"角色管理_绑定_并未绑定": {
			{"当前群内并未绑定角色", 1},
		},
		"角色管理_加载成功": {
			{"角色{$t玩家}加载成功，欢迎回来", 1},
		},
		"角色管理_加载失败_已绑定": {
			{"当前群内是绑卡状态，请解除绑卡后进行此操作！", 1},
		},
		"角色管理_角色不存在": {
			{"无法加载/删除角色：你所指定的角色不存在", 1},
		},
		"角色管理_序列化失败": {
			{"无法加载/保存角色：序列化失败", 1},
		},
		"角色管理_储存成功": {
			{"角色\"{$t角色名}\"储存成功\n注: 非秘密团不用开团前存卡，跑团后save即可", 1},
		},
		"角色管理_储存失败_已绑定": {
			{"角色卡\"{$t角色名}\"是绑定状态，无法进行save操作", 1},
		},
		"角色管理_删除成功": {
			{"角色\"{$t角色名}\"删除成功", 1},
		},
		"角色管理_删除失败_已绑定": {
			{"角色卡\"{$t角色名}\"是绑定状态，\".pc untagAll {$t角色名}\"解除绑卡后再操作吧", 1},
		},
		"角色管理_删除成功_当前卡": {
			{"由于你删除的角色是当前角色，昵称和属性将被一同清空", 1},
		},
		// -------------------- pc end --------------------------
		"提示_私聊不可用": {
			{"该指令只在群组中可用", 1},
		},
		"提示_无权限": {
			{"你没有权限这样做", 1},
		},
		"提示_无权限_非master/管理/邀请者": {
			{"你不是管理员、邀请者或master", 1},
		},
		"提示_无权限_非master/管理": {
			{"你不是管理员或master", 1},
		},
		"提示_手动退群前缀": {
			{"因长期不使用等原因，骰主后台操作退群", 1},
		},
		"留言_已记录": {
			{"您的留言已被记录，另外注意不要滥用此功能，祝您生活愉快，再会。", 1},
		},
		"拦截_完全拦截_收到的所有消息": {
			{"", 1},
		},
		"拦截_完全拦截_收到的指令": {
			{"命令包含不当内容，{核心:骰子名字}拒绝响应。", 1},
		},
		"拦截_完全拦截_发出的消息": { // 未来可加入“部分拦截”，如仅替换敏感词
			{"试图使{核心:骰子名字}回复不当内容，拒绝响应。", 1},
		},
		"拦截_警告内容_提醒级": {
			{"你已多次触发不当内容拦截，{核心:骰子名字}已经无法忍受！", 1},
		},
		"拦截_警告内容_注意级": {
			{"你已多次触发不当内容拦截，{核心:骰子名字}已经无法忍受！", 1},
		},
		"拦截_警告内容_警告级": {
			{"你已多次触发不当内容拦截，{核心:骰子名字}已经无法忍受！", 1},
		},
		"拦截_警告内容_危险级": {
			{"你已多次触发不当内容拦截，{核心:骰子名字}已经无法忍受！", 1},
		},
		"刷屏_警告内容_个人": {
			{"警告：您的指令频率过高，请注意。", 1},
		},
		"刷屏_警告内容_群组": {
			{"警告：该群组内指令频率过高，请注意。", 1},
		},
		"快捷指令_新增": {
			{`已成功定义指令「{$t指令}」的{$t指令来源}快捷方式「{$t快捷指令名}」，触发方式：\n.&{$t快捷指令名} 或\n.a {$t快捷指令名}`, 1},
		},
		"快捷指令_新增_无指令": {
			{"未指定要定义{$t指令来源}快捷方式的指令", 1},
		},
		"快捷指令_替换": {
			{`{$t指令来源}快捷指令「{$t快捷指令名}」被替换为指令「{$t指令}」，其旧指令为「{$t旧指令}」，触发方式：\n.&{$t快捷指令名} 或\n.a {$t快捷指令名}`, 1},
		},
		"快捷指令_删除": {
			{"已成功删除{$t指令来源}快捷指令「{$t快捷指令名}」，曾对应指令「{$t旧指令}」", 1},
		},
		"快捷指令_删除_未定义": {
			{"尝试删除{$t指令来源}快捷指令「{$t快捷指令名}」，但并未定义过", 1},
		},
		"快捷指令_列表": {
			{`可用的快捷指令如下：\n{$t列表内容}\n（群快捷指令优先于个人）`, 1},
		},
		"快捷指令_列表_空": {
			{"未定义任何快捷指令", 1},
		},
		"快捷指令_列表_单行": {
			{"[{$t指令来源}].&{$t快捷指令名} => {$t指令}", 1},
		},
		"快捷指令_列表_分隔符": {
			{`\n`, 1},
		},
		"快捷指令_非群聊": {
			{"不在群聊中，群快捷指令相关命令不可用", 1},
		},
		"快捷指令_禁止": {
			{"不允许定义这样的快捷指令", 1},
		},
		"快捷指令触发_前缀": {
			{`※ {$t指令来源}快捷指令 {$t目标指令}\n`, 1},
		},
		"快捷指令触发_无指令": {
			{"未设置快捷指令 {$t目标指令名}，或该快捷指令不对应一个命令", 1},
		},
		"黑名单触发_当事人": {
			{"提醒：你引发了黑名单事件:\n{$t黑名单事件}", 1},
		},
		"黑名单触发_所在群": {
			{"提醒：当前群组发生了黑名单事件:\n{$t黑名单事件}", 1},
		},
		"黑名单触发_邀请人": {
			{"提醒: 你邀请的骰子在群组<{$t事发群名}>({$t事发群号})中遭遇黑名单事件:\n{$t黑名单事件}", 1},
		},
		"黑名单惩罚_退群": {
			{"因拉黑惩罚选项中有“退出事发群”，即将自动退群。", 1},
		},
	},
	"娱乐": {
		"今日人品": {
			{"{$t玩家} 今日人品为{$t人品}，{%\n    $t人品 > 95 ? '人品爆表！',\n    $t人品 > 80 ? '运气还不错！',\n    $t人品 > 50 ? '人品还行吧',\n    $t人品 > 10 ? '今天不太行',\n    1 ? '流年不利啊！'\n%}", 1},
		},
	},
	"其它": {
		"抽牌_牌堆列表": {
			{"载入并开启的牌堆:\n{$t牌堆列表}", 1},
		},
		"抽牌_列表": {
			{"{$t原始列表}", 1},
		},
		"抽牌_列表_没有牌组": {
			{`呃，没有发现任何牌组`, 1},
		},
		"抽牌_找不到牌组": {
			{"找不到这个牌组", 1},
		},
		"抽牌_找不到牌组_存在类似": {
			{"未找到牌组，但发现一些相似的:", 1},
		},
		"抽牌_分隔符": {
			{`\n\n`, 1},
		},
		"抽牌_结果前缀": {
			{``, 1},
		},
		"随机名字": {
			{"为{$t玩家}生成以下名字：\n{$t随机名字文本}", 1},
		},
		"随机名字_分隔符": {
			{"、", 1},
		},
		"戳一戳": {
			{"{核心:骰子名字}咕踊了一下", 1},
		},
		"ping响应": {
			{"pong！这里是{核心:骰子名字}", 1},
		},
		"校验_成功": {
			{"本次生成的神秘海豹码：\n{$t校验码}", 1},
		},
	},
	"日志": {
		"记录_新建": {
			{`新的故事开始了，祝旅途愉快！\n记录已经开启`, 1},
		},
		"记录_开启_成功": {
			{`故事"{$t记录名称}"的记录已经继续开启，当前已记录文本{$t当前记录条数}`, 1},
		},
		"记录_开启_失败_无此记录": {
			{`无法继续，没能找到记录: {$t记录名称}`, 1},
		},
		"记录_开启_失败_尚未新建": {
			{`找不到记录，请使用.log new新建记录`, 1},
		},
		"记录_开启_失败_未结束的记录": {
			{`当前已有记录中的日志{$t记录名称}，请先将其结束。`, 1},
		},
		"记录_关闭_成功": {
			{`当前记录"{$t记录名称}"已经暂停，已记录文本{$t当前记录条数}条\n结束故事并传送日志请用.log end`, 1},
		},
		"记录_关闭_失败": {
			{`没有找到正在进行的记录，已经是关闭状态。这可能表示您忘记了开启记录。`, 1},
		},
		"记录_取出_未指定记录": {
			{`命令格式错误：当前没有开启状态的记录，或没有通过参数指定要取出的日志。请参考帮助。`, 1},
		},
		"记录_列出_导入语": {
			{`正在列出存在于此群的记录:`, 1},
		},
		"记录_结束": {
			{`故事落下了帷幕。\n记录已经关闭。`, 1},
		},
		"记录_新建_失败_未结束的记录": {
			{`上一段旅程{$t记录名称}还未结束，请先使用.log end结束故事。`, 1},
		},
		"记录_条数提醒": {
			{`提示: 当前故事的文本已经记录了 {$t条数} 条`, 1},
		},
		"记录_导出_邮箱发送前缀": {
			{`已向以下邮箱发送记录邮件：\n`, 1},
		},
		"记录_导出_无格式有效邮箱": {
			{`未提供格式有效的邮箱，将直接发送记录文件`, 1},
		},
		"记录_导出_未指定记录": {
			{`未指定记录名`, 1},
		},
		"记录_导出_文件名前缀": {
			{`【{$t记录名}】{$t日期}{$t时间}`, 1},
		},
		"记录_导出_邮件附言": {
			{"log文件见附件。", 1},
		},
		"记录_删除_成功": {
			{"删除记录 {$t记录名称} 成功", 1},
		},
		"记录_删除_失败_找不到": {
			{"删除记录 {$t记录名称} 失败，可能是名字不对", 1},
		},
		"记录_删除_失败_正在进行": {
			{"记录 {$t记录名称} 正在进行，无法删除。请先用 log end 结束记录，如不希望上传请用 log halt。", 1},
		},
		"OB_开启": {
			{"你将成为观众（自动修改昵称和群名片[如有权限]，并不会给观众发送暗骰结果）。", 1},
		},
		"OB_关闭": {
			{"你不再是观众了（自动修改昵称和群名片[如有权限]）。", 1},
		},
		// 1.4.2+
		"记录_上传_成功": {
			{`跑团日志已上传服务器，链接如下：{$t日志链接}`, 1},
		},
		"记录_上传_失败": {
			{`跑团日志上传失败：{$t错误原因}\n若未出现线上日志地址，可换时间重试，或联系骰主在data/default/log-exports路径下取出日志\n文件名: 群号_日志名_随机数.zip\n注意此文件log end/get后才会生成`, 1},
		},
		// 1.5.0+
		"名片_自动设置": {
			{`已自动设置名片格式为{$t名片格式}：{$t名片预览}\n如有权限会在属性更新时自动更新名片。使用.sn off可关闭。`, 1},
		},
		"名片_取消设置": {
			{`已关闭对{$t玩家}的名片自动修改。`, 1},
		},
		"记录_导出_成功": {
			{`日志文件《{$t文件名字}》已上传至群文件，请自行到群文件查看。`, 1},
		},
	},
}
